{
  "base_model_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct",
  "peft_type": "LORA",
  "r": 16,
  "lora_alpha": 32,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "fan_in_fan_out": false,
  "bias": "none",
  "modules_to_save": null,
  "timestamp": "20260524_090223",
  "era_nodes_learned": 5
}